eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/netx_driver/src/nx_wifi.c
/**************************************************************************/
/*                                                                        */
/*       Copyright (c) Microsoft Corporation. All rights reserved.        */
/*                                                                        */
/*       This software is licensed under the Microsoft Software License   */
/*       Terms for Microsoft Azure RTOS. Full text of the license can be  */
/*       found in the LICENSE file at https://aka.ms/AzureRTOS_EULA       */
/*       and in the root directory of this software.                      */
/*                                                                        */
/**************************************************************************/


/**************************************************************************/
/**************************************************************************/
/**                                                                       */
/** NetX Component                                                        */
/**                                                                       */
/**   NetX Porting layer for STM32L4XX                                    */
/**                                                                       */
/**************************************************************************/
/**************************************************************************/

#include <stdint.h>

#include "tx_api.h"
#include "nx_api.h"
#include "nx_ip.h"
#include "nx_tcp.h"
#include "tx_thread.h"
#include "nx_wifi.h"

#include <r_wifi_sx_ulpgn_if.h>

/////
#define WIFI_PAYLOAD_SIZE (1536u)


#define WIFI_STATUS_OK (0u)

#define WIFI_TIMEOUT                             30000

#define WIFI_TRANSPORT_TIMEOUT                   30000

/////

#define WIFI_WRITE_TIMEOUT          100
#define WIFI_READ_TIMEOUT           100

#ifndef WIFI_THREAD_PERIOD
#define WIFI_THREAD_PERIOD          100
#endif /* WIFI_THREAD_PERIOD  */

/* Define the default thread priority, stack size, etc. The user can override this
   via -D command line option or via project settings.  */

#ifndef NX_WIFI_STACK_SIZE
#define NX_WIFI_STACK_SIZE          (1024)
#endif /* NX_WIFI_STACK_SIZE  */

#ifndef NX_WIFI_THREAD_PRIORITY
#define NX_WIFI_THREAD_PRIORITY     (1)
#endif /* NX_WIFI_THREAD_PRIORITY  */

/* Define the stack for X-WARE WIFI.  */
static UCHAR                        nx_wifi_thread_stack[NX_WIFI_STACK_SIZE];

/* Define the prototypes for X-WARE.  */
static TX_THREAD                    nx_wifi_thread;
static NX_PACKET_POOL               *nx_wifi_pool;
static NX_IP                        *nx_wifi_ip;

/* Define the socket type, TCP socket or UDP socket.  */
#define NX_WIFI_TCP_SOCKET          0
#define NX_WIFI_UDP_SOCKET          1

/* Reserve some packets for applications, such as HTTP, etc.  */
#ifndef NX_WIFI_PACKET_RESERVED
#define NX_WIFI_PACKET_RESERVED     1
#endif /* NX_WIFI_PACKET_RESERVED  */

/* Define the WIFI socket structure.  */
typedef struct NX_WIFI_SOCKET_STRUCT
{

    /* Define socket pointer.  */
    VOID       *nx_wifi_socket_ptr;

    /* Define socket flag.  */
    CHAR        nx_wifi_socket_valid;

    /* Define socket type.  TCP or UDP.  */
    CHAR        nx_wifi_socket_type;

    /* Define the connected flag.  */
    CHAR        nx_wifi_socket_connected;

    /* Reserved.  */
    CHAR        reserved;

    /* Define the deferred packet processing queue.  */
    NX_PACKET   *nx_wifi_received_packet_head,
                *nx_wifi_received_packet_tail;

#ifdef NX_ENABLE_IP_PACKET_FILTER

    /* Define the UDP connected IP and port.  */
    ULONG       nx_wifi_udp_socket_connect_ip;
    UINT        nx_wifi_udp_socket_connect_port;
#endif /* NX_ENABLE_IP_PACKET_FILTER */
    int32_t     socket_id;

} NX_WIFI_SOCKET;

#ifndef NX_WIFI_SOCKET_COUNTER
#define NX_WIFI_SOCKET_COUNTER          4
#endif /* NX_WIFI_SOCKET_COUNTER  */

/* Define the TCP socket and UDP socket.  */
static NX_WIFI_SOCKET               nx_wifi_socket[NX_WIFI_SOCKET_COUNTER];

/* Define the SOCKET ID.  */
static CHAR                         nx_wifi_socket_counter;

/* Define the buffer to receive data from wifi.  */
static CHAR                         nx_wifi_buffer[WIFI_PAYLOAD_SIZE];

#ifdef NX_ENABLE_IP_PACKET_FILTER

/* Define the wifi IP address.  */
static ULONG                        nx_wifi_ip_address = 0;

/* Define the buffer to build fake IP header and TCP/UDP header.
   IP Header: 20 bytes, TCP header: 20 bytes.  */
static CHAR                         nx_wifi_ip_buffer[40];

/* Define the ip packet filter.  */
static UINT  nx_wifi_ip_packet_filter(ULONG source_ip, ULONG destination_ip,
                                      ULONG source_port, ULONG destination_port,
                                      ULONG protocol, ULONG packet_length, UINT direction);
#endif /* NX_ENABLE_IP_PACKET_FILTER */

/* Define the wifi thread.  */
static void    nx_wifi_thread_entry(ULONG thread_input);

/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_initialize                                  PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function initializes the NetX Wifi.                            */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    ip_ptr                                Pointer to IP control block   */
/*    packet_pool                           Packet pool pointer           */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*  09-30-2020     Yuxin Zhou               Modified comment(s),          */
/*                                            resulting in version 6.1    */
/*                                                                        */
/**************************************************************************/
UINT nx_wifi_initialize(NX_IP *ip_ptr, NX_PACKET_POOL *packet_pool)
{

