eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/netx_driver/src/nx_wifi.c
UINT    status;


    /* Set the IP.  */
    nx_wifi_ip = ip_ptr;

    /* Set the pool.  */
    nx_wifi_pool = packet_pool;

    /* Initialize the wifi.  */
    memset(nx_wifi_socket, 0, (NX_WIFI_SOCKET_COUNTER * sizeof(NX_WIFI_SOCKET)));

    /* Initialize the socket id.  */
    nx_wifi_socket_counter = 0;

    /* Create the wifi thread.  */
    status = tx_thread_create(&nx_wifi_thread, "Wifi Thread", nx_wifi_thread_entry, 0,
                              nx_wifi_thread_stack, NX_WIFI_STACK_SIZE,
                              NX_WIFI_THREAD_PRIORITY, NX_WIFI_THREAD_PRIORITY, TX_NO_TIME_SLICE, TX_AUTO_START);

    /* Check for thread create errors.  */
    if (status)
        return(status);

    return(NX_SUCCESS);
}

/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_thread_entry                                PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function is the entry point for NetX Wifi helper thread.  The  */
/*    Wifi helper thread is responsible for receiving packet.             */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    thread_input                          Pointer to IP control block   */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*  09-30-2020     Yuxin Zhou               Modified comment(s), and      */
/*                                            optimized internal code,    */
/*                                            resulting in version 6.1    */
/*                                                                        */
/**************************************************************************/
void nx_wifi_thread_entry(ULONG thread_input)
{

UINT            i;
UINT            socket_counter;
int32_t         size;
UINT            status;
NX_PACKET       *packet_ptr;
NX_TCP_SOCKET   *tcp_socket;
NX_UDP_SOCKET   *udp_socket;
#ifdef NX_ENABLE_IP_PACKET_FILTER
wifi_ip_configuration_t ip_cfg;
#endif /* NX_ENABLE_IP_PACKET_FILTER */


#ifdef NX_ENABLE_IP_PACKET_FILTER
    if (R_WIFI_SX_ULPGN_GetIpAddress(&ip_cfg) == WIFI_STATUS_OK)
    {
        nx_wifi_ip_address = ip_cfg.ipaddress;
    }
#endif /* NX_ENABLE_IP_PACKET_FILTER  */

    while(1)
    {

        /* Obtain the IP internal mutex before processing the IP event.  */
        tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);

        socket_counter = 0;

        /* Check if have socket.  */
        if (nx_wifi_socket_counter != 0)
        {

            /* Loop to receive the data from */
            for (i = 0; (i < NX_WIFI_SOCKET_COUNTER) && (socket_counter < nx_wifi_socket_counter); i++)
            {

                /* Check if the socket is valid and connected.  */
                if ((nx_wifi_socket[i].nx_wifi_socket_valid == 0) || (nx_wifi_socket[i].nx_wifi_socket_connected == 0))
                    continue;

                /* Update the socket counter.  */
                socket_counter++;

                /* Loop to receive the data from wifi for current socket.  */
                status = WIFI_STATUS_OK;
                do
                {

                    /* Make sure there is enough space to store the data before receiving data from WIFI.  */
                    if ((nx_wifi_pool -> nx_packet_pool_available * nx_wifi_pool -> nx_packet_pool_payload_size) <
                        (WIFI_PAYLOAD_SIZE + (NX_WIFI_PACKET_RESERVED * nx_wifi_pool -> nx_packet_pool_payload_size)))
                        break;

                    /* Receive the data in WIFI_READ_TIMEOUT ms.  */
                    size = R_WIFI_SX_ULPGN_ReceiveSocket(nx_wifi_socket[i].socket_id,
                            (uint8_t *)nx_wifi_buffer, WIFI_PAYLOAD_SIZE, WIFI_READ_TIMEOUT);
                    /* Check status.  */
                    if ((size <= 0))
                        break;

                    /* Allocate one packet to store the data.  */
                    if (nx_packet_allocate(nx_wifi_pool, &packet_ptr,  NX_RECEIVE_PACKET, NX_NO_WAIT))
                        break;

                    /* Set the data.  */
                    if (nx_packet_data_append(packet_ptr, nx_wifi_buffer, size, nx_wifi_pool, NX_NO_WAIT))
                    {
                        nx_packet_release(packet_ptr);
                        break;
                    }

                    /* Check to see if the deferred processing queue is empty.  */
                    if (nx_wifi_socket[i].nx_wifi_received_packet_head)
                    {

