eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/netx_driver/src/nx_wifi.c
                        /* Not empty, just place the packet at the end of the queue.  */
                        (nx_wifi_socket[i].nx_wifi_received_packet_tail) -> nx_packet_queue_next =  packet_ptr;
                        packet_ptr -> nx_packet_queue_next =  NX_NULL;
                        nx_wifi_socket[i].nx_wifi_received_packet_tail =  packet_ptr;

                    }
                    else
                    {

                        /* Empty deferred receive processing queue.  Just setup the head pointers and
                           set the event flags to ensure the IP helper thread looks at the deferred processing
                           queue.  */
                        nx_wifi_socket[i].nx_wifi_received_packet_head =  packet_ptr;
                        nx_wifi_socket[i].nx_wifi_received_packet_tail =  packet_ptr;
                        packet_ptr -> nx_packet_queue_next =             NX_NULL;

                        /* Check the socket type.  */
                        if (nx_wifi_socket[i].nx_wifi_socket_type == NX_WIFI_TCP_SOCKET)
                        {

                            /* Get the tcp socket.  */
                            tcp_socket = (NX_TCP_SOCKET *)nx_wifi_socket[i].nx_wifi_socket_ptr;

#ifdef NX_ENABLE_IP_PACKET_FILTER
                            nx_wifi_ip_packet_filter(tcp_socket -> nx_tcp_socket_connect_ip.nxd_ip_address.v4,
                                                     nx_wifi_ip_address,
                                                     tcp_socket -> nx_tcp_socket_connect_port,
                                                     tcp_socket -> nx_tcp_socket_port,
                                                     NX_IP_TCP, size, NX_IP_PACKET_IN);
#endif /* NX_ENABLE_IP_PACKET_FILTER */

                            /* Determine if there is a socket receive notification function specified.  */
                            if (tcp_socket -> nx_tcp_receive_callback)
                            {

                                /* Yes, notification is requested.  Call the application's receive notification
                                   function for this socket.  */
                                (tcp_socket -> nx_tcp_receive_callback)(tcp_socket);
                            }
                        }
                        else
                        {

                            /* Get the udp socket.  */
                            udp_socket = (NX_UDP_SOCKET *)nx_wifi_socket[i].nx_wifi_socket_ptr;

#ifdef NX_ENABLE_IP_PACKET_FILTER

                            /* Process packet filter.  */
                            nx_wifi_ip_packet_filter(nx_wifi_socket[i].nx_wifi_udp_socket_connect_ip,
                                                     nx_wifi_ip_address,
                                                     nx_wifi_socket[i].nx_wifi_udp_socket_connect_port,
                                                     udp_socket -> nx_udp_socket_port,
                                                     NX_IP_UDP, size, NX_IP_PACKET_IN);
#endif /* NX_ENABLE_IP_PACKET_FILTER */

                            /* Determine if there is a socket receive notification function specified.  */
                            if (udp_socket -> nx_udp_receive_callback)
                            {

                                /* Yes, notification is requested.  Call the application's receive notification
                                   function for this socket.  */
                                (udp_socket -> nx_udp_receive_callback)(udp_socket);
                            }
                        }
                    }

                    /* Queue the packet.  */
                }while (status == WIFI_STATUS_OK);
            }
        }

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));

        /* Sleep some ticks to next loop.  */
        tx_thread_sleep(WIFI_THREAD_PERIOD);
    }
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_tick_convert_ms                             PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function converts the ticks to milliseconds.                   */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    tick                                  Tick value                    */
/*    millisecond                           Destination to millisecond    */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*  09-30-2020     Yuxin Zhou               Modified comment(s),          */
/*                                            resulting in version 6.1    */
/*                                                                        */
/**************************************************************************/
static VOID  nx_wifi_tick_convert_ms(ULONG tick, ULONG *millisecond)
{

UINT    factor = 1000/NX_IP_PERIODIC_RATE;


    /* Check the wait_option.  */
    if (tick)
    {

