eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/netx_driver/src/nx_wifi.c
        /* Change ticks to milliseconds to ticks.  */
        if (tick >= NX_WAIT_FOREVER/factor)
            *millisecond = NX_WAIT_FOREVER;
        else
            *millisecond = (tick * factor);
    }
    else
    {
        *millisecond = 0;
    }
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_socket_entry_find                           PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function finds an available entry.                             */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    socket_ptr                            Socket pointer                */
/*    entry_index                           Destination to entry          */
/*    entry_find                            Find flag                     */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*  09-30-2020     Yuxin Zhou               Modified comment(s),          */
/*                                            resulting in version 6.1    */
/*                                                                        */
/**************************************************************************/
static UINT  nx_wifi_socket_entry_find(void *socket_ptr, UCHAR *entry_index, UCHAR entry_find)
{

UINT    i;
UCHAR   empty_index = NX_WIFI_SOCKET_COUNTER;

    /* Loop to find an empty entry.  */
    for (i = 0; i < NX_WIFI_SOCKET_COUNTER; i++)
    {

        /* Check the valid flag.  */
        if (nx_wifi_socket[i].nx_wifi_socket_valid)
        {

            /* Check if the entry already exist.  */
            if (nx_wifi_socket[i].nx_wifi_socket_ptr == socket_ptr)
            {

                /* Check if find the entry.  */
                if (entry_find)
                {
                    *entry_index = i;
                    return(NX_SUCCESS);
                }
                else
                {
                    return(NX_NOT_SUCCESSFUL);
                }
            }
        }
        else
        {

            /* Set the empty index.  */
            if (empty_index > i)
                empty_index = i;
        }
    }

    /* Check if have empty entry.  */
    if (empty_index >= NX_WIFI_SOCKET_COUNTER)
        return (NX_NOT_SUCCESSFUL);

    (*entry_index) = empty_index;
    return(NX_SUCCESS);
}



/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_socket_reset                                PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function resets the entry and release the packet.              */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    socket_ptr                            Socket pointer                */
/*    entry_index                           Destination to entry          */
/*    entry_find                            Find flag                     */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*  09-30-2020     Yuxin Zhou               Modified comment(s),          */
/*                                            resulting in version 6.1    */
/*                                                                        */
/**************************************************************************/
static void  nx_wifi_socket_reset(UCHAR entry_index)
{

NX_PACKET *next_packet;
NX_PACKET *current_packet;

    /* Check if this is an valid entry.  */
    if (nx_wifi_socket[entry_index].nx_wifi_socket_valid == 0)
        return;

