eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/netx_driver/src/nx_wifi.c
    /* Setup next packet to queue head.  */
    next_packet = nx_wifi_socket[entry_index].nx_wifi_received_packet_head;

    /* Release any packets queued up.  */
    while (next_packet)
    {

        /* Setup the current packet pointer.  */
        current_packet =  next_packet;

        /* Move to the next packet.  */
        next_packet =  next_packet -> nx_packet_queue_next;

        /* Release the current packet.  */
        nx_packet_release(current_packet);
    }

    /* Reset the entry.  */
    memset(&nx_wifi_socket[entry_index], 0, sizeof(NX_WIFI_SOCKET));
    nx_wifi_socket_counter--;
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_socket_receive                              PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function receives packet for wifi socket                       */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    socket_ptr                            Socket pointer                */
/*    packet_ptr                            Pointer to received packet    */
/*    wait_option                           Suspension option             */
/*    socket_type                           Socket type                   */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*  09-30-2020     Yuxin Zhou               Modified comment(s), and      */
/*                                            optimized internal code,    */
/*                                            resulting in version 6.1    */
/*                                                                        */
/**************************************************************************/
static UINT  nx_wifi_socket_receive(VOID *socket_ptr, NX_PACKET **packet_ptr, ULONG wait_option, UINT socket_type)
{

UINT    status;
UCHAR   entry_index;
ULONG   total_millisecond;
ULONG   wait_millisecond;
UINT    start_time;
ULONG   millisecond;
USHORT  size;
UINT    received_packet = NX_FALSE;
#ifdef NX_ENABLE_IP_PACKET_FILTER
NX_TCP_SOCKET *tcp_socket;
NX_UDP_SOCKET *udp_socket;
#endif /* NX_ENABLE_IP_PACKET_FILTER */

    /* Obtain the IP internal mutex before processing the IP event.  */
    tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);

    /* Find an avaiable entry.  */
    if (nx_wifi_socket_entry_find((void *)socket_ptr, &entry_index, 1))
    {

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }

    /* Check if the socket is connected.  */
    if (nx_wifi_socket[entry_index].nx_wifi_socket_connected == 0)
    {

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }

    /* Convert the tick to millisecond.  */
    nx_wifi_tick_convert_ms(wait_option, &total_millisecond);

    /* Receive the packet from queue.  */
    if (nx_wifi_socket[entry_index].nx_wifi_received_packet_head)
    {

        /* Remove the first packet and process it!  */

        /* Pickup the first packet.  */
        *packet_ptr =  nx_wifi_socket[entry_index].nx_wifi_received_packet_head;

        /* Move the head pointer to the next packet.  */
        nx_wifi_socket[entry_index].nx_wifi_received_packet_head =  (*packet_ptr) -> nx_packet_queue_next;

        /* Check for end of deferred processing queue.  */
        if (nx_wifi_socket[entry_index].nx_wifi_received_packet_head == NX_NULL)
        {

            /* Yes, the queue is empty.  Set the tail pointer to NULL.  */
            nx_wifi_socket[entry_index].nx_wifi_received_packet_tail =  NX_NULL;
        }

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_SUCCESS);
    }
    else
    {

