eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/netx_driver/src/nx_wifi.c
        /* Get the start time.  */
        start_time = tx_time_get();

        /* Loop to receive a packet.  */
        while(total_millisecond)
        {

            /* Check if exceed the max value of WIFI_TIMEOUT.  */
            if (total_millisecond > WIFI_TIMEOUT)
                wait_millisecond = WIFI_TIMEOUT;
            else
                wait_millisecond = total_millisecond;

            /* Check if exceed the max value of WIFI_TRANSPORT_TIMEOUT.  */
            if (wait_millisecond > WIFI_TRANSPORT_TIMEOUT)
                wait_millisecond = WIFI_TRANSPORT_TIMEOUT;

            /* Receive the data within a specified time.  */
            size = R_WIFI_SX_ULPGN_ReceiveSocket(nx_wifi_socket[entry_index].socket_id,
                    (uint8_t *)nx_wifi_buffer, WIFI_PAYLOAD_SIZE, WIFI_READ_TIMEOUT);

            /* Check status.  */
            if ((size <= 0))
            {

                /* Convert the tick to millisecond.  */
                nx_wifi_tick_convert_ms((tx_time_get() - start_time), &millisecond);

                /* Update the remaining millisecond.  */
                if (millisecond >= total_millisecond)
                    total_millisecond = 0;
                else
                    total_millisecond -=millisecond;

                continue;
            }
            else
            {
                received_packet = NX_TRUE;
                break;
            }
        }

        /* Check if receive a packet.  */
        if (received_packet != NX_TRUE)
        {

            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            return(NX_NO_PACKET);
        }

#ifdef NX_ENABLE_IP_PACKET_FILTER

        /* Check the socket type.  */
        if (nx_wifi_socket[entry_index].nx_wifi_socket_type == NX_WIFI_TCP_SOCKET)
        {

            /* Get the tcp socket.  */
            tcp_socket = (NX_TCP_SOCKET *)nx_wifi_socket[entry_index].nx_wifi_socket_ptr;

            /* Process packet filter.  */
            nx_wifi_ip_packet_filter(tcp_socket -> nx_tcp_socket_connect_ip.nxd_ip_address.v4,
                                     nx_wifi_ip_address,
                                     tcp_socket -> nx_tcp_socket_connect_port,
                                     tcp_socket -> nx_tcp_socket_port,
                                     NX_IP_TCP, size, NX_IP_PACKET_IN);
        }
        else
        {

            /* Get the udp socket.  */
            udp_socket = (NX_UDP_SOCKET *)nx_wifi_socket[entry_index].nx_wifi_socket_ptr;

            /* Process packet filter.  */
            nx_wifi_ip_packet_filter(nx_wifi_socket[entry_index].nx_wifi_udp_socket_connect_ip,
                                     nx_wifi_ip_address,
                                     nx_wifi_socket[entry_index].nx_wifi_udp_socket_connect_port,
                                     udp_socket -> nx_udp_socket_port,
                                     NX_IP_UDP, size, NX_IP_PACKET_IN);
        }
#endif /* NX_ENABLE_IP_PACKET_FILTER  */

        /* Allocate one packet to store the data.  */
        if (nx_packet_allocate(nx_wifi_pool, packet_ptr,  NX_RECEIVE_PACKET, NX_NO_WAIT))
        {

            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            return(NX_NOT_SUCCESSFUL);
        }

        /* Set the data.  */
        if (nx_packet_data_append(*packet_ptr, nx_wifi_buffer, size, nx_wifi_pool, NX_NO_WAIT))
        {

            /* Release the packet.  */
            nx_packet_release(*packet_ptr);

            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            return(NX_NOT_SUCCESSFUL);
        }

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_SUCCESS);
    }
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_tcp_client_socket_connect                   PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function sends wifi connection command                         */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    socket_ptr                            Socket pointer                */
/*    packet_ptr                            Pointer to received packet    */
/*    wait_option                           Suspension option             */
/*    socket_type                           Socket type                   */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*  09-30-2020     Yuxin Zhou               Modified comment(s),          */
/*                                            resulting in version 6.1    */
/*                                                                        */
/**************************************************************************/
UINT  nx_wifi_tcp_client_socket_connect(NX_TCP_SOCKET *socket_ptr,
                                        NXD_ADDRESS *server_ip,
                                        UINT server_port,
                                        ULONG wait_option)
{

int32_t status;
UCHAR   entry_index;


    /* Obtain the IP internal mutex before processing the IP event.  */
    tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);

    /* Find an available entry.  */
    if (nx_wifi_socket_entry_find((void *)socket_ptr, &entry_index, 0))
    {

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }

