eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/netx_driver/src/nx_wifi.c
    /* Set the entry info.  */
    nx_wifi_socket[entry_index].nx_wifi_socket_ptr = (void *)socket_ptr;
    nx_wifi_socket[entry_index].nx_wifi_socket_valid = 1;
    nx_wifi_socket[entry_index].nx_wifi_socket_type = NX_WIFI_TCP_SOCKET;
    nx_wifi_socket[entry_index].nx_wifi_socket_connected = 0;
    nx_wifi_socket_counter++;

    /* Swap the address.  */
    //NX_CHANGE_ULONG_ENDIAN(server_ip -> nxd_ip_address.v4);

    /* Create the socket. */
    status = R_WIFI_SX_ULPGN_CreateSocket(WIFI_SOCKET_IP_PROTOCOL_TCP, WIFI_SOCKET_IP_VERSION_4);

    if (status >= 0)
    {    
        /* Wifi connect.  */
        nx_wifi_socket[entry_index].socket_id = status;
        status = R_WIFI_SX_ULPGN_ConnectSocket(nx_wifi_socket[entry_index].socket_id, server_ip -> nxd_ip_address.v4, server_port, NULL);
    }

    /* Swap the address.  */
    //NX_CHANGE_ULONG_ENDIAN(server_ip -> nxd_ip_address.v4);

    if(status == WIFI_SUCCESS)
    {

        /* Update the connect flag.  */
        nx_wifi_socket[entry_index].nx_wifi_socket_connected = 1;

        /* Update the address and port.  */
        socket_ptr -> nx_tcp_socket_connect_ip.nxd_ip_version = NX_IP_VERSION_V4;
        socket_ptr -> nx_tcp_socket_connect_ip.nxd_ip_address.v4 = server_ip -> nxd_ip_address.v4;
        socket_ptr -> nx_tcp_socket_connect_port = server_port;
        socket_ptr -> nx_tcp_socket_state =  NX_TCP_ESTABLISHED;

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_SUCCESS);
    }
    else
    {

        /* Reset the entry.  */
        nx_wifi_socket_reset(entry_index);

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_tcp_socket_disconnect                       PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function sends wifi disconnect command                         */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    socket_ptr                            Pointer to TCP client socket  */
/*    wait_option                           Suspension option             */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*  09-30-2020     Yuxin Zhou               Modified comment(s),          */
/*                                            resulting in version 6.1    */
/*                                                                        */
/**************************************************************************/
UINT  nx_wifi_tcp_socket_disconnect(NX_TCP_SOCKET *socket_ptr, ULONG wait_option)
{

wifi_err_t wifi_err;
UCHAR   entry_index;


    /* Obtain the IP internal mutex before processing the IP event.  */
    tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);

    /* Check if the entry already exist.  */
    if (nx_wifi_socket_entry_find((void *)socket_ptr, &entry_index, 1))
    {

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }

    /* Check if the socket is connected.  */
    if (nx_wifi_socket[entry_index].nx_wifi_socket_connected == 0)
    {

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }

    /* Close connection.  */
    wifi_err = R_WIFI_SX_ULPGN_CloseSocket(nx_wifi_socket[entry_index].socket_id);
    /* Reset the entry.  */
    socket_ptr -> nx_tcp_socket_state = NX_TCP_CLOSED;

    /* Reset the entry.  */
    nx_wifi_socket_reset(entry_index);

    /* Release the IP internal mutex before processing the IP event.  */
    tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));

