eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/netx_driver/src/nx_wifi.c
    if(wifi_err != WIFI_SUCCESS) {
        return(NX_NOT_SUCCESSFUL);
    }
    /* Return success.  */
    return(NX_SUCCESS);
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_tcp_socket_send                             PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function sends a TCP packet.                                   */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    socket_ptr                            Pointer to socket             */
/*    packet_ptr                            Pointer to packet to send     */
/*    wait_option                           Suspension option             */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*  09-30-2020     Yuxin Zhou               Modified comment(s),          */
/*                                            resulting in version 6.1    */
/*                                                                        */
/**************************************************************************/
UINT  nx_wifi_tcp_socket_send(NX_TCP_SOCKET *socket_ptr, NX_PACKET *packet_ptr, ULONG wait_option)
{

UINT        status ;
UCHAR       entry_index;
USHORT      send_data_length;
ULONG       packet_size;
NX_PACKET   *current_packet;


    /* Obtain the IP internal mutex before processing the IP event.  */
    tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);

    /* Find an avaiable entry.  */
    if (nx_wifi_socket_entry_find((void *)socket_ptr, &entry_index, 1))
    {

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }

    /* Check if the socket is connected.  */
    if (nx_wifi_socket[entry_index].nx_wifi_socket_connected == 0)
    {

        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }

    /* Initialize the current packet to the input packet pointer.  */
    current_packet =  packet_ptr;

    /* Loop to send the packet.  */
    while(current_packet)
    {

        /* Calculate current packet size. */
        packet_size = (ULONG)(current_packet -> nx_packet_append_ptr - current_packet -> nx_packet_prepend_ptr);

        /* Send data.  */
        send_data_length = R_WIFI_SX_ULPGN_SendSocket (nx_wifi_socket[entry_index].socket_id, current_packet -> nx_packet_prepend_ptr, packet_size, WIFI_WRITE_TIMEOUT);

        /* Check status.  */
        if ((send_data_length != packet_size))
        {

            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            return (NX_NOT_SUCCESSFUL);
        }

#ifdef NX_ENABLE_IP_PACKET_FILTER

        /* Process packet filter.  */
        nx_wifi_ip_packet_filter(nx_wifi_ip_address,
                                 socket_ptr -> nx_tcp_socket_connect_ip.nxd_ip_address.v4,
                                 socket_ptr -> nx_tcp_socket_port,
                                 socket_ptr -> nx_tcp_socket_connect_port,
                                 NX_IP_TCP, packet_size, NX_IP_PACKET_OUT);
#endif /* NX_ENABLE_IP_PACKET_FILTER */

#ifndef NX_DISABLE_PACKET_CHAIN
        /* We have crossed the packet boundary.  Move to the next packet
           structure.  */
        current_packet =  current_packet -> nx_packet_next;
#else

        /* End the loop.  */
        current_packet = NX_NULL;
#endif /* NX_DISABLE_PACKET_CHAIN */
    }

    /* Release the packet.  */
    nx_packet_release(packet_ptr);

    /* Release the IP internal mutex before processing the IP event.  */
    tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));

