eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/netx_driver/src/nx_wifi.c
    /* Check if already open the connection.  */
    if (nx_wifi_socket[entry_index].nx_wifi_socket_connected == 0)
    {
        /* Swap the address.  */
//        NX_CHANGE_ULONG_ENDIAN(ip_address -> nxd_ip_address.v4);

        /* Create the socket. */
        status = R_WIFI_SX_ULPGN_CreateSocket(WIFI_SOCKET_IP_PROTOCOL_UDP, WIFI_SOCKET_IP_VERSION_4);

        if (status >= 0)
        {    
            /* Wifi connect.  */
            nx_wifi_socket[entry_index].socket_id = status;
            status = R_WIFI_SX_ULPGN_ConnectSocket(nx_wifi_socket[entry_index].socket_id, ip_address->nxd_ip_address.v4, port, NULL);
        }

        /* Swap the address.  */
//        NX_CHANGE_ULONG_ENDIAN(ip_address -> nxd_ip_address.v4);

        /* Check status.  */
        if(status != WIFI_SUCCESS)
        {
            /* Reset the entry.  */
            nx_wifi_socket_reset(entry_index);

            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            return(NX_NOT_SUCCESSFUL);
        }

        /* Update the connect flag.  */
        nx_wifi_socket[entry_index].nx_wifi_socket_connected = 1;

#ifdef NX_ENABLE_IP_PACKET_FILTER

        /* Set IP and port.  */
        nx_wifi_socket[entry_index].nx_wifi_udp_socket_connect_ip = ip_address -> nxd_ip_address.v4;
        nx_wifi_socket[entry_index].nx_wifi_udp_socket_connect_port = port;
#endif /* NX_ENABLE_IP_PACKET_FILTER */
    }

    /* Initialize the current packet to the input packet pointer.  */
    current_packet =  packet_ptr;

    /* Loop to send the packet.  */
    while(current_packet)
    {

        /* Calculate current packet size. */
        packet_size = (ULONG)(current_packet -> nx_packet_append_ptr - current_packet -> nx_packet_prepend_ptr);

        /* Loop to send data.  */
        send_data_length = R_WIFI_SX_ULPGN_SendSocket(nx_wifi_socket[entry_index].socket_id, current_packet->nx_packet_prepend_ptr, packet_size, WIFI_WRITE_TIMEOUT);

        /* Check status.  */
        if (send_data_length != packet_size)
        {

            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            return(NX_NOT_SUCCESSFUL);
        }

#ifdef NX_ENABLE_IP_PACKET_FILTER

        /* Process packet filter.  */
        nx_wifi_ip_packet_filter(nx_wifi_ip_address,
                                 nx_wifi_socket[entry_index].nx_wifi_udp_socket_connect_ip,
                                 socket_ptr -> nx_udp_socket_port,
                                 nx_wifi_socket[entry_index].nx_wifi_udp_socket_connect_port,
                                 NX_IP_UDP, packet_size, NX_IP_PACKET_OUT);
#endif /* NX_ENABLE_IP_PACKET_FILTER */

#ifndef NX_DISABLE_PACKET_CHAIN
        /* We have crossed the packet boundary.  Move to the next packet
           structure.  */
        current_packet =  current_packet -> nx_packet_next;
#else

        /* End the loop.  */
        current_packet = NX_NULL;
#endif /* NX_DISABLE_PACKET_CHAIN */
    }

    /* Release the packet.  */
    nx_packet_release(packet_ptr);

    /* Release the IP internal mutex before processing the IP event.  */
    tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
    return(NX_SUCCESS);
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_udp_socket_receive                          PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function receives UDP packet.                                  */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    socket_ptr                            Pointer to UDP socket         */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*  09-30-2020     Yuxin Zhou               Modified comment(s),          */
/*                                            resulting in version 6.1    */
/*                                                                        */
/**************************************************************************/
UINT  nx_wifi_udp_socket_receive(NX_UDP_SOCKET *socket_ptr, NX_PACKET **packet_ptr, ULONG wait_option)
{
    return(nx_wifi_socket_receive((VOID*)socket_ptr, packet_ptr, wait_option, NX_WIFI_UDP_SOCKET));
}


#ifdef NX_ENABLE_IP_PACKET_FILTER
/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_wifi_ip_packet_filter                            PORTABLE C      */
/*                                                           6.1          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function builds fake IP header and TCP/UDP header to filter.   */
/*                                                                        */
/*    Note: Only fill source IP, destination IP and Protocol in IP header */
/*    and fill source port and destination port in TCP/UDP header.        */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    source_ip                             Source IP address             */
/*    destination_ip                        Destination IP address        */
/*    source_port                           Source port                   */
/*    destination_port                      Destination port              */
/*    protocol                              Protocol: TCP/UDP             */
/*    packet_length                         Lenght of packet              */
/*    direction                             Direction: IN/OUT             */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                Completion status             */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application Code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  09-30-2020     Yuxin Zhou               Initial Version 6.1           */
/*                                                                        */
/**************************************************************************/
static UINT  nx_wifi_ip_packet_filter(ULONG source_ip, ULONG destination_ip,
                                      ULONG source_port, ULONG destination_port,
                                      ULONG protocol, ULONG packet_length, UINT direction)
{

NX_IPV4_HEADER *ip_header_ptr;
ULONG port;
UINT status;

    /* Check if the IP packet filter is set. */
    if (nx_wifi_ip -> nx_ip_packet_filter)
    {

        /* Initialize the buffer.  */
        memset(nx_wifi_ip_buffer, 0, 40);

        /* Update packet length.  */
        if (protocol == NX_IP_TCP)
        {
            packet_length += 40;
        }
        else
        {
            packet_length += 28;
        }

        /* Fill IP header.  */
        ip_header_ptr = (NX_IPV4_HEADER *) nx_wifi_ip_buffer;

        /* Build the first 32-bit word of the IP header.  */
        ip_header_ptr -> nx_ip_header_word_0 = (NX_IP_VERSION | (0xFFFF & packet_length));

        /* Build the third 32-bit word of the IP header.  */
        ip_header_ptr -> nx_ip_header_word_2 = protocol;

        /* Place the source IP address in the IP header.  */
        ip_header_ptr -> nx_ip_header_source_ip = source_ip;

        /* Place the destination IP address in the IP header.  */
        ip_header_ptr -> nx_ip_header_destination_ip = destination_ip;

        NX_CHANGE_ULONG_ENDIAN(ip_header_ptr -> nx_ip_header_word_0);
        NX_CHANGE_ULONG_ENDIAN(ip_header_ptr -> nx_ip_header_word_2);
        NX_CHANGE_ULONG_ENDIAN(ip_header_ptr -> nx_ip_header_source_ip);
        NX_CHANGE_ULONG_ENDIAN(ip_header_ptr -> nx_ip_header_destination_ip);

        /* Fill the TCP/UDP ports.  */
        port = (source_port << NX_SHIFT_BY_16) | (destination_port);
        NX_CHANGE_ULONG_ENDIAN(port);
        memcpy(&nx_wifi_ip_buffer[20], &port, 4); /* Use case of memcpy is verified.  */

        /* Yes, call the IP packet filter routine. */
        status = nx_wifi_ip -> nx_ip_packet_filter(nx_wifi_ip_buffer, direction);

        if (status)
        {
            return (status);
        }
    }

    return(NX_SUCCESS);
}
#endif /* NX_ENABLE_IP_PACKET_FILTER */
